Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_spi.c
/****************************************************************************
 * vendor/espressif/chips/esp32p4/esp32p4_spi.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * ESP32-P4 SPI Bus Driver
 *
 * This driver implements the NuttX spi_dev_s interface for the ESP32-P4
 * GP-SPI peripherals (SPI2 and SPI3).  The implementation uses polling
 * for data transfer and supports configurable clock frequency, mode,
 * and bit order.
 *
 * Key features:
 *   - SPI master mode
 *   - Full-duplex data transfer
 *   - Configurable clock frequency (up to 80 MHz)
 *   - SPI mode 0-3 (CPOL/CPHA)
 *   - 8-bit word size (default)
 *   - GPIO matrix pin routing
 *   - CS control via software (GPIO) or hardware
 *
 * ESP-IDF reference:
 *   - examples/peripherals/spi_master/lcd
 *   - components/esp_driver_spi/src/gpspi/spi_master.c
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/spi.h>

#include "hardware/esp32p4_spi.h"
#include "hardware/esp32p4_gpio.h"
#include "hardware/esp32p4_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* SPI timeout in busy-wait iterations */

#define SPI_TIMEOUT_COUNT           100000

/* Default SPI pins if not configured via Kconfig */

#ifndef CONFIG_ESP32P4_SPI2_CLK_GPIO
#  define CONFIG_ESP32P4_SPI2_CLK_GPIO   12
#endif

#ifndef CONFIG_ESP32P4_SPI2_MISO_GPIO
#  define CONFIG_ESP32P4_SPI2_MISO_GPIO  13
#endif

#ifndef CONFIG_ESP32P4_SPI2_MOSI_GPIO
#  define CONFIG_ESP32P4_SPI2_MOSI_GPIO  14
#endif

#ifndef CONFIG_ESP32P4_SPI3_CLK_GPIO
#  define CONFIG_ESP32P4_SPI3_CLK_GPIO   15
#endif

#ifndef CONFIG_ESP32P4_SPI3_MISO_GPIO
#  define CONFIG_ESP32P4_SPI3_MISO_GPIO  16
#endif

#ifndef CONFIG_ESP32P4_SPI3_MOSI_GPIO
#  define CONFIG_ESP32P4_SPI3_MOSI_GPIO  17
#endif

/* Default CS GPIO pins */

#ifndef CONFIG_ESP32P4_SPI2_CS0_GPIO
#  define CONFIG_ESP32P4_SPI2_CS0_GPIO   11
#endif

#ifndef CONFIG_ESP32P4_SPI3_CS0_GPIO
#  define CONFIG_ESP32P4_SPI3_CS0_GPIO   18
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* SPI bus private data structure */

struct esp32p4_spi_priv_s
{
  struct spi_dev_s  spidev;       /* SPI device (must be first) */
  uint32_t          base;         /* SPI register base address */
  uint32_t          frequency;    /* Current SPI frequency */
  uint32_t          actual_freq;  /* Actual SPI frequency achieved */
  enum spi_mode_e   mode;         /* Current SPI mode */
  uint8_t           nbits;        /* Bits per word (8 or 16) */
  mutex_t           lock;         /* Bus lock mutex */
  bool              initialized;  /* True if hardware is configured */

  /* GPIO signal numbers for this SPI controller */

  uint8_t           clk_sig;      /* CLK signal index */
  uint8_t           miso_sig;     /* MISO signal index */
  uint8_t           mosi_sig;     /* MOSI signal index */
  uint8_t           cs_sig;       /* CS0 signal index */

  /* GPIO pin numbers */

  uint8_t           clk_gpio;     /* CLK GPIO pin */
  uint8_t           miso_gpio;    /* MISO GPIO pin */
  uint8_t           mosi_gpio;    /* MOSI GPIO pin */
  uint8_t           cs_gpio;      /* CS0 GPIO pin */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* SPI ops interface */

static int      esp32p4_spi_lock(FAR struct spi_dev_s *dev, bool lock);
static void     esp32p4_spi_select(FAR struct spi_dev_s *dev,
                                   uint32_t devid, bool selected);
static uint32_t esp32p4_spi_setfrequency(FAR struct spi_dev_s *dev,
                                         uint32_t frequency);
static void     esp32p4_spi_setmode(FAR struct spi_dev_s *dev,
                                    enum spi_mode_e mode);
static void     esp32p4_spi_setbits(FAR struct spi_dev_s *dev, int nbits);
static uint32_t esp32p4_spi_send(FAR struct spi_dev_s *dev, uint32_t wd);
#ifdef CONFIG_SPI_EXCHANGE
static void     esp32p4_spi_exchange(FAR struct spi_dev_s *dev,
                                     FAR const void *txbuffer,
                                     FAR void *rxbuffer,
                                     size_t nwords);
#endif
static uint8_t  esp32p4_spi_status(FAR struct spi_dev_s *dev,
                                   uint32_t devid);

/* Internal helper functions */

static void     esp32p4_spi_config_gpio(struct esp32p4_spi_priv_s *priv);
static void     esp32p4_spi_configure(struct esp32p4_spi_priv_s *priv);
static uint32_t esp32p4_spi_calc_clock(struct esp32p4_spi_priv_s *priv,
                                       uint32_t freq);
static void     esp32p4_spi_wait_done(struct esp32p4_spi_priv_s *priv);
static uint32_t esp32p4_spi_xfer_word(struct esp32p4_spi_priv_s *priv,
                                      uint32_t wd);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* SPI2 instance */

#ifdef CONFIG_ESP32P4_SPI2
static const struct spi_ops_s g_spi2_ops =
{
  .lock          = esp32p4_spi_lock,
  .select        = esp32p4_spi_select,
  .setfrequency  = esp32p4_spi_setfrequency,
  .setmode       = esp32p4_spi_setmode,
  .setbits       = esp32p4_spi_setbits,
  .status        = esp32p4_spi_status,
  .send          = esp32p4_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange      = esp32p4_spi_exchange,
#endif
};

