Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_spi.c
static struct esp32p4_spi_priv_s g_spi2_priv =
{
  .spidev =
  {
    .ops = &g_spi2_ops,
  },
  .base       = SPI2_BASE,
  .frequency  = 1000000,  /* Default 1 MHz */
  .mode       = SPIDEV_MODE0,
  .nbits      = 8,
  .lock       = NXMUTEX_INITIALIZER,
  .initialized = false,
  .clk_sig    = SPI2_CLK_OUT_SIG,
  .miso_sig   = SPI2_MISO_IN_SIG,
  .mosi_sig   = SPI2_MOSI_OUT_SIG,
  .cs_sig     = SPI2_CS0_OUT_SIG,
  .clk_gpio   = CONFIG_ESP32P4_SPI2_CLK_GPIO,
  .miso_gpio  = CONFIG_ESP32P4_SPI2_MISO_GPIO,
  .mosi_gpio  = CONFIG_ESP32P4_SPI2_MOSI_GPIO,
  .cs_gpio    = CONFIG_ESP32P4_SPI2_CS0_GPIO,
};
#endif /* CONFIG_ESP32P4_SPI2 */

/* SPI3 instance */

#ifdef CONFIG_ESP32P4_SPI3
static const struct spi_ops_s g_spi3_ops =
{
  .lock          = esp32p4_spi_lock,
  .select        = esp32p4_spi_select,
  .setfrequency  = esp32p4_spi_setfrequency,
  .setmode       = esp32p4_spi_setmode,
  .setbits       = esp32p4_spi_setbits,
  .status        = esp32p4_spi_status,
  .send          = esp32p4_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange      = esp32p4_spi_exchange,
#endif
};

static struct esp32p4_spi_priv_s g_spi3_priv =
{
  .spidev =
  {
    .ops = &g_spi3_ops,
  },
  .base       = SPI3_BASE,
  .frequency  = 1000000,  /* Default 1 MHz */
  .mode       = SPIDEV_MODE0,
  .nbits      = 8,
  .lock       = NXMUTEX_INITIALIZER,
  .initialized = false,
  .clk_sig    = SPI3_CLK_OUT_SIG,
  .miso_sig   = SPI3_MISO_IN_SIG,
  .mosi_sig   = SPI3_MOSI_OUT_SIG,
  .cs_sig     = SPI3_CS0_OUT_SIG,
  .clk_gpio   = CONFIG_ESP32P4_SPI3_CLK_GPIO,
  .miso_gpio  = CONFIG_ESP32P4_SPI3_MISO_GPIO,
  .mosi_gpio  = CONFIG_ESP32P4_SPI3_MOSI_GPIO,
  .cs_gpio    = CONFIG_ESP32P4_SPI3_CS0_GPIO,
};
#endif /* CONFIG_ESP32P4_SPI3 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_spi_config_gpio
 *
 * Description:
 *   Configure GPIO pins for SPI CLK, MISO, MOSI, and CS via the
 *   GPIO matrix.
 *
 ****************************************************************************/

static void esp32p4_spi_config_gpio(struct esp32p4_spi_priv_s *priv)
{
  uint32_t regval;

  /* Configure CLK pin: output via GPIO matrix */

  regval = priv->clk_sig & GPIO_FUNC_OUT_SEL_M;
  REG_WRITE(GPIO_FUNC_OUT_SEL_CFG_REG(priv->clk_gpio), regval);

  /* Configure MOSI pin: output via GPIO matrix */

  regval = priv->mosi_sig & GPIO_FUNC_OUT_SEL_M;
  REG_WRITE(GPIO_FUNC_OUT_SEL_CFG_REG(priv->mosi_gpio), regval);

  /* Configure CS pin: output via GPIO matrix */

  regval = priv->cs_sig & GPIO_FUNC_OUT_SEL_M;
  REG_WRITE(GPIO_FUNC_OUT_SEL_CFG_REG(priv->cs_gpio), regval);

  /* Configure MISO input routing:
   * Route the GPIO pin to the SPI MISO input signal.
   */

  regval = priv->miso_gpio & 0x3f;
  REG_WRITE(GPIO_FUNC_IN_SEL_CFG_REG(priv->miso_sig), regval);

  /* Configure CLK pin: GPIO function, output, push-pull */

  regval = IO_MUX_GPIO_FUNC << IO_MUX_MCU_SEL_S;
  regval |= (2 << IO_MUX_FUN_DRV_S); /* Drive strength 2 */
  REG_WRITE(IO_MUX_GPIO_REG(priv->clk_gpio), regval);

  /* Configure MOSI pin: GPIO function, output, push-pull */

  regval = IO_MUX_GPIO_FUNC << IO_MUX_MCU_SEL_S;
  regval |= (2 << IO_MUX_FUN_DRV_S);
  REG_WRITE(IO_MUX_GPIO_REG(priv->mosi_gpio), regval);

  /* Configure MISO pin: GPIO function, input enabled, pull-up */

  regval = IO_MUX_GPIO_FUNC << IO_MUX_MCU_SEL_S;
  regval |= IO_MUX_FUN_WPU;     /* Pull-up */
  regval |= IO_MUX_FUN_IE;      /* Input enable */
  regval |= (2 << IO_MUX_FUN_DRV_S);
  REG_WRITE(IO_MUX_GPIO_REG(priv->miso_gpio), regval);

  /* Configure CS pin: GPIO function, output, push-pull */

  regval = IO_MUX_GPIO_FUNC << IO_MUX_MCU_SEL_S;
  regval |= (2 << IO_MUX_FUN_DRV_S);
  REG_WRITE(IO_MUX_GPIO_REG(priv->cs_gpio), regval);

  /* Set CS high (inactive) by default */

  if (priv->cs_gpio < 32)
    {
      REG_WRITE(GPIO_OUT_W1TS_REG, (1 << priv->cs_gpio));
    }
  else
    {
      REG_WRITE(GPIO_OUT1_W1TS_REG, (1 << (priv->cs_gpio - 32)));
    }
}

/****************************************************************************
 * Name: esp32p4_spi_calc_clock
 *
 * Description:
 *   Calculate the SPI clock divider for the requested frequency.
 *
 *   The SPI clock is derived from the APB clock:
 *     SPI_CLK = APB_CLK / (pre_div * (N + 1))
 *
 *   Returns the actual frequency achieved.
 *
 ****************************************************************************/

static uint32_t esp32p4_spi_calc_clock(struct esp32p4_spi_priv_s *priv,
                                       uint32_t freq)
{
  uint32_t pre_div;
  uint32_t n;
  uint32_t regval;

  /* If requested frequency >= APB clock, use system clock directly */

  if (freq >= SPI_APB_CLK_FREQ)
    {
      REG_WRITE(priv->base + SPI_CLOCK_REG, SPI_CLK_EQU_SYSCLK);
      return SPI_APB_CLK_FREQ;
    }

  /* Calculate pre-divider and N counter.
   * We want: freq = APB_CLK / (pre_div * (N + 1))
   * Strategy: find the smallest pre_div that gives N <= 63
   */

  for (pre_div = 1; pre_div <= 64; pre_div++)
    {
      n = (SPI_APB_CLK_FREQ / (freq * pre_div));
      if (n == 0)
        {
          n = 1;
        }

      if (n <= 64)
        {
          break;
        }
    }

  if (pre_div > 64)
    {
      pre_div = 64;
      n = 1;
    }

  /* Build clock register value:
   * CLKDIV_PRE [23:18] = pre_div - 1
   * CLKCNT_N   [5:0]   = n - 1
   * CLKCNT_H   [11:6]  = (n / 2) - 1  (50% duty cycle)
   * CLKCNT_L   [17:12] = (n / 2) - 1  (50% duty cycle)
   */

  regval = (((pre_div - 1) << SPI_CLKDIV_PRE_S) & SPI_CLKDIV_PRE_M) |
           (((n - 1) << SPI_CLKCNT_N_S) & SPI_CLKCNT_N_M) |
           ((((n / 2) - 1) << SPI_CLKCNT_H_S) & SPI_CLKCNT_H_M) |
           ((((n / 2) - 1) << SPI_CLKCNT_L_S) & SPI_CLKCNT_L_M);

  REG_WRITE(priv->base + SPI_CLOCK_REG, regval);

  return SPI_APB_CLK_FREQ / (pre_div * n);
}

/****************************************************************************
 * Name: esp32p4_spi_configure
 *
 * Description:
 *   Configure the SPI controller hardware based on current settings.
 *
 ****************************************************************************/

