Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_spi.c
static void esp32p4_spi_configure(struct esp32p4_spi_priv_s *priv)
{
  uint32_t user_reg;
  uint32_t misc_reg;

  /* Configure clock */

  priv->actual_freq = esp32p4_spi_calc_clock(priv, priv->frequency);

  /* Configure USER register for mode and data direction */

  user_reg = SPI_USR_MOSI |     /* Enable TX data phase */
             SPI_USR_MISO |     /* Enable RX data phase */
             SPI_DOUTDIN;        /* Full-duplex */

  /* Configure clock polarity (CPOL) and phase (CPHA) based on mode */

  misc_reg = 0;

  switch (priv->mode)
    {
      case SPIDEV_MODE0:  /* CPOL=0, CPHA=0 */
        misc_reg &= ~SPI_CK_IDLE_EDGE;  /* Clock idle low */
        user_reg &= ~SPI_CK_OUT_EDGE;   /* Sample on rising edge */
        break;

      case SPIDEV_MODE1:  /* CPOL=0, CPHA=1 */
        misc_reg &= ~SPI_CK_IDLE_EDGE;  /* Clock idle low */
        user_reg |= SPI_CK_OUT_EDGE;    /* Sample on falling edge */
        break;

      case SPIDEV_MODE2:  /* CPOL=1, CPHA=0 */
        misc_reg |= SPI_CK_IDLE_EDGE;   /* Clock idle high */
        user_reg |= SPI_CK_OUT_EDGE;    /* Sample on falling edge */
        break;

      case SPIDEV_MODE3:  /* CPOL=1, CPHA=1 */
        misc_reg |= SPI_CK_IDLE_EDGE;   /* Clock idle high */
        user_reg &= ~SPI_CK_OUT_EDGE;   /* Sample on rising edge */
        break;

      default:
        break;
    }

  /* Set CS idle level high (active low) */

  misc_reg |= SPI_CS_IDLE_VAL;

  /* Write registers */

  REG_WRITE(priv->base + SPI_USER_REG, user_reg);
  REG_WRITE(priv->base + SPI_MISC_REG, misc_reg);

  /* Configure data bit length (8 bits = 8-1 = 7) */

  REG_WRITE(priv->base + SPI_MS_DLEN_REG,
            ((priv->nbits - 1) << SPI_MS_DATA_BITLEN_S) &
            SPI_MS_DATA_BITLEN_M);

  /* Configure command phase: no command */

  REG_WRITE(priv->base + SPI_USER2_REG, 0);

  /* Configure address phase: no address */

  REG_WRITE(priv->base + SPI_USER1_REG, 0);

  /* Mark as initialized */

  priv->initialized = true;
}

/****************************************************************************
 * Name: esp32p4_spi_wait_done
 *
 * Description:
 *   Wait for the SPI transfer to complete (TRANS_DONE interrupt flag).
 *
 ****************************************************************************/

static void esp32p4_spi_wait_done(struct esp32p4_spi_priv_s *priv)
{
  int timeout = SPI_TIMEOUT_COUNT;

  while (timeout-- > 0)
    {
      if (REG_READ(priv->base + SPI_INT_RAW_REG) & SPI_TRANS_DONE_INT)
        {
          /* Clear the interrupt */

          REG_WRITE(priv->base + SPI_INT_CLR_REG, SPI_TRANS_DONE_INT);
          return;
        }
    }

  spierr("ERROR: SPI transfer timeout\n");
}

/****************************************************************************
 * Name: esp32p4_spi_xfer_word
 *
 * Description:
 *   Transfer a single word (8 or 16 bits) on the SPI bus.
 *   Returns the received word.
 *
 ****************************************************************************/

static uint32_t esp32p4_spi_xfer_word(struct esp32p4_spi_priv_s *priv,
                                      uint32_t wd)
{
  /* Write data to TX buffer */

  REG_WRITE(priv->base + SPI_W(0), wd);

  /* Start the transfer */

  REG_WRITE(priv->base + SPI_CMD_REG, SPI_USR);

  /* Wait for transfer to complete */

  esp32p4_spi_wait_done(priv);

  /* Read and return received data */

  return REG_READ(priv->base + SPI_R(0));
}

/****************************************************************************
 * Name: esp32p4_spi_lock
 *
 * Description:
 *   Lock or unlock the SPI bus.
 *
 ****************************************************************************/

static int esp32p4_spi_lock(FAR struct spi_dev_s *dev, bool lock)
{
  FAR struct esp32p4_spi_priv_s *priv = (FAR struct esp32p4_spi_priv_s *)dev;
  int ret;

  if (lock)
    {
      ret = nxmutex_lock(&priv->lock);
    }
  else
    {
      ret = nxmutex_unlock(&priv->lock);
    }

  return ret;
}

/****************************************************************************
 * Name: esp32p4_spi_select
 *
 * Description:
 *   Select or deselect the SPI device.
 *
 *   CS is active low.  When selected, CS is driven low; when deselected,
 *   CS is driven high.
 *
 ****************************************************************************/

static void esp32p4_spi_select(FAR struct spi_dev_s *dev, uint32_t devid,
                               bool selected)
{
  FAR struct esp32p4_spi_priv_s *priv = (FAR struct esp32p4_spi_priv_s *)dev;

  /* Ensure hardware is configured */

  if (!priv->initialized)
    {
      esp32p4_spi_config_gpio(priv);
      esp32p4_spi_configure(priv);
    }

  /* Drive CS: active low */

  if (selected)
    {
      /* CS active (low) */

      if (priv->cs_gpio < 32)
        {
          REG_WRITE(GPIO_OUT_W1TC_REG, (1 << priv->cs_gpio));
        }
      else
        {
          REG_WRITE(GPIO_OUT1_W1TC_REG, (1 << (priv->cs_gpio - 32)));
        }
    }
  else
    {
      /* CS inactive (high) */

      if (priv->cs_gpio < 32)
        {
          REG_WRITE(GPIO_OUT_W1TS_REG, (1 << priv->cs_gpio));
        }
      else
        {
          REG_WRITE(GPIO_OUT1_W1TS_REG, (1 << (priv->cs_gpio - 32)));
        }
    }
}

/****************************************************************************
 * Name: esp32p4_spi_setfrequency
 *
 * Description:
 *   Set the SPI bus frequency.
 *
 *   Returns the actual frequency achieved.
 *
 ****************************************************************************/

static uint32_t esp32p4_spi_setfrequency(FAR struct spi_dev_s *dev,
                                         uint32_t frequency)
{
  FAR struct esp32p4_spi_priv_s *priv = (FAR struct esp32p4_spi_priv_s *)dev;

  if (priv->frequency != frequency)
    {
      priv->frequency = frequency;

      if (priv->initialized)
        {
          priv->actual_freq = esp32p4_spi_calc_clock(priv, frequency);
        }
    }

  return priv->actual_freq;
}

/****************************************************************************
 * Name: esp32p4_spi_setmode
 *
 * Description:
 *   Set the SPI mode.
 *
 ****************************************************************************/

static void esp32p4_spi_setmode(FAR struct spi_dev_s *dev,
                                enum spi_mode_e mode)
{
  FAR struct esp32p4_spi_priv_s *priv = (FAR struct esp32p4_spi_priv_s *)dev;

  if (priv->mode != mode)
    {
      priv->mode = mode;

      if (priv->initialized)
        {
          esp32p4_spi_configure(priv);
        }
    }
}

/****************************************************************************
 * Name: esp32p4_spi_setbits
 *
 * Description:
 *   Set the number of bits per word.
 *
 ****************************************************************************/

static void esp32p4_spi_setbits(FAR struct spi_dev_s *dev, int nbits)
{
  FAR struct esp32p4_spi_priv_s *priv = (FAR struct esp32p4_spi_priv_s *)dev;

