Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_spi.c
  if (priv->nbits != nbits)
    {
      priv->nbits = nbits;

      if (priv->initialized)
        {
          esp32p4_spi_configure(priv);
        }
    }
}

/****************************************************************************
 * Name: esp32p4_spi_status
 *
 * Description:
 *   Get SPI status.
 *
 ****************************************************************************/

static uint8_t esp32p4_spi_status(FAR struct spi_dev_s *dev,
                                  uint32_t devid)
{
  /* Always report present */

  return SPI_STATUS_PRESENT;
}

/****************************************************************************
 * Name: esp32p4_spi_send
 *
 * Description:
 *   Exchange one word on SPI.
 *
 ****************************************************************************/

static uint32_t esp32p4_spi_send(FAR struct spi_dev_s *dev, uint32_t wd)
{
  FAR struct esp32p4_spi_priv_s *priv = (FAR struct esp32p4_spi_priv_s *)dev;

  /* Ensure hardware is configured */

  if (!priv->initialized)
    {
      esp32p4_spi_config_gpio(priv);
      esp32p4_spi_configure(priv);
    }

  return esp32p4_spi_xfer_word(priv, wd);
}

/****************************************************************************
 * Name: esp32p4_spi_exchange
 *
 * Description:
 *   Exchange a block of data on SPI (full-duplex).
 *
 *   This transfers nwords between txbuffer and rxbuffer simultaneously.
 *   If txbuffer is NULL, zeros are sent.  If rxbuffer is NULL, received
 *   data is discarded.
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_EXCHANGE
static void esp32p4_spi_exchange(FAR struct spi_dev_s *dev,
                                 FAR const void *txbuffer,
                                 FAR void *rxbuffer,
                                 size_t nwords)
{
  FAR struct esp32p4_spi_priv_s *priv = (FAR struct esp32p4_spi_priv_s *)dev;
  FAR const uint8_t *txptr = (FAR const uint8_t *)txbuffer;
  FAR uint8_t *rxptr = (FAR uint8_t *)rxbuffer;
  size_t i;
  uint32_t txword;
  uint32_t rxword;

  /* Ensure hardware is configured */

  if (!priv->initialized)
    {
      esp32p4_spi_config_gpio(priv);
      esp32p4_spi_configure(priv);
    }

  /* Transfer words one at a time */

  for (i = 0; i < nwords; i++)
    {
      /* Get the TX word */

      if (txptr != NULL)
        {
          if (priv->nbits <= 8)
            {
              txword = (uint32_t)txptr[i];
            }
          else
            {
              txword = (uint32_t)((FAR const uint16_t *)txbuffer)[i];
            }
        }
      else
        {
          txword = 0;
        }

      /* Transfer the word */

      rxword = esp32p4_spi_xfer_word(priv, txword);

      /* Store the RX word */

      if (rxptr != NULL)
        {
          if (priv->nbits <= 8)
            {
              rxptr[i] = (uint8_t)(rxword & 0xff);
            }
          else
            {
              ((FAR uint16_t *)rxbuffer)[i] = (uint16_t)(rxword & 0xffff);
            }
        }
    }
}
#endif /* CONFIG_SPI_EXCHANGE */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_spidev_register
 *
 * Description:
 *   Register an SPI bus driver for the specified SPI port.
 *
 *   This function initializes the SPI controller hardware and registers
 *   the SPI device at /dev/spiN.
 *
 * Input Parameters:
 *   port - SPI port number (2 for SPI2, 3 for SPI3)
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.
 *
 ****************************************************************************/

int esp32p4_spidev_register(int port)
{
  FAR struct esp32p4_spi_priv_s *priv;
  FAR struct spi_dev_s *spidev;

  switch (port)
    {
#ifdef CONFIG_ESP32P4_SPI2
      case 2:
        priv = &g_spi2_priv;
        break;
#endif

#ifdef CONFIG_ESP32P4_SPI3
      case 3:
        priv = &g_spi3_priv;
        break;
#endif

      default:
        spierr("ERROR: Invalid SPI port: %d\n", port);
        return -EINVAL;
    }

  spidev = &priv->spidev;

  /* Initialize the SPI hardware */

  esp32p4_spi_config_gpio(priv);
  esp32p4_spi_configure(priv);

  /* Register the SPI device */

  spiinfo("SPI%d registered successfully (base=0x%08" PRIx32 ")\n",
          port, priv->base);

  return OK;
}
